[{
	"Product":"MICNELF",
	"Sub-Desc":"COMPLETE MICRONUTRIENT FOLIAR SPRAY FOR HORTICULTURAL AND VEGETABLE CROPS",
	"Description":"Micronutrients play a vital role in plant physiology and biochemistry. They should be included in any Plant – Nutrition programme either through the soil or through foliar form. When micronutrients are supplemented through foliar sprays, the advantage is that all the micronutrients are made available at the site of assimilation (leaf) and the plants can utilize them more efficiently. There is no loss of nutrients through leaching or binding with other nutrients within the leaf. Micnelf is a complete foliar micronutrient spray product specifically designed with the physiology of horticultural and high yielding vegetable crops in mind. All six essential micronutrients (iron, manganese, zinc, copper, molybdenum and boron) required for the healthy growth of the plants are included in a balanced ratio. Micnelf is 100% water soluble, easily absorbed by the leaves and cost effective.",
	"Recommendation":"Our recommendation package is based on crop requirement at different stages. Micnelf ensures new sprouts with good vegetative growth, supports optimum flower setting and in turn fruit setting and imparts quality to the produce while it is ripening. Regular sprays of Micnelf impart resistance against disease incidence and strengthen the immune system of the crops. For perennial horticultural crops we recommend 3 - 4 rounds of MICNELF MS-32 @ 0.5% from the time of flowering to fruit maturity and around 2 - 4 rounds for maintaining the health of the crop. Total around 6 - 8 rounds of sprays of Micnelf MS - 32 is recommended. A light and uniform spray is suggested. For vegetable crops with high yielding potential, we recommend around 4 - 5 rounds of MICNELF MS – 24 @ 0.5% which ensures vegetative growth and effective flower – fruit set imparting the quality to the produce. Regular spraying will ensure qualitative and quantitative increase in yields of the crops.",
	"Category":"FOLIAR APPLICATION"	
},{
	"Product":"MICMOLL",
	"Sub-Desc":"COMPLETE MICRONUTRIENT FOLIAR SPRAY FOR HORTICULTURAL AND VEGETABLE CROPS",
	"Description":"Micronutrients play a vital role in plant physiology and biochemistry. They should be included in any Plant – Nutrition programme either through the soil or through foliar form. When micronutrients are supplemented through foliar sprays, the advantage is that all the micronutrients are made available at the site of assimilation (leaf) and the plants can utilize them more efficiently. There is no loss of nutrients through leaching or binding with other nutrients within the leaf. Micnelf is a complete foliar micronutrient spray product specifically designed with the physiology of horticultural and high yielding vegetable crops in mind. All six essential micronutrients (iron, manganese, zinc, copper, molybdenum and boron) required for the healthy growth of the plants are included in a balanced ratio. Micnelf is 100% water soluble, easily absorbed by the leaves and cost effective.",
	"Recommendation":"Our recommendation package is based on crop requirement at different stages. Micnelf ensures new sprouts with good vegetative growth, supports optimum flower setting and in turn fruit setting and imparts quality to the produce while it is ripening. Regular sprays of Micnelf impart resistance against disease incidence and strengthen the immune system of the crops. For perennial horticultural crops we recommend 3 - 4 rounds of MICNELF MS-32 @ 0.5% from the time of flowering to fruit maturity and around 2 - 4 rounds for maintaining the health of the crop. Total around 6 - 8 rounds of sprays of Micnelf MS - 32 is recommended. A light and uniform spray is suggested. For vegetable crops with high yielding potential, we recommend around 4 - 5 rounds of MICNELF MS – 24 @ 0.5% which ensures vegetative growth and effective flower – fruit set imparting the quality to the produce. Regular spraying will ensure qualitative and quantitative increase in yields of the crops.",
	"Category":"FOLIAR APPLICATION"	
},
{
	"Product":"KIECITE CF",
	"Sub-Desc":"COMPLETE MICRONUTRIENT FOLIAR SPRAY FOR COFFEE",
	"Description":"Kiecite CF is a complete micronutrient foliar product specifically designed with the physiology of coffee in mind. It is scientifically developed to include six micronutrients in a balanced formulation- Iron, Manganese, Zinc, Copper, Boron and Molybdenum. Micronutrients play a vital role in plant physiology and biochemistry and should be included in a plant-nutrition program. Being in a sulfatic form, Kiecite CF is 100% water-soluble, easily absorbed by the leaves, incidentally provide sulfur, is cost-competitive and affordable. Kiecite CF is a foliar spray and the points of entry into the plant system are the stomata on the leaves.",
	"Recommendation":"",
	"Category":"FOLIAR APPLICATION"
}]