[{
	"Product":"Potassium Schoenite",
	"Sub-Desc":"Double Sulphate Salt of Potassium and Magnesium",
	"Description":"Every crop requires specific nutrients in its different growth stages. Likewise, the requirement of Potassium is high in senescence stage of the crop. It is in high demand at this stage for uniform and timely maturity of the end produce. Potassium not only improves size and quality of the produce but also imparts disease and pest resistance at this crucial stage of the crop. Magnesium is a primal component of Chlorophyll; responsible for bringing out maximum photosynthetic activity in the crop. Magnesium is known to impart attractive colour and lustre to the end produce, thus contributing towards marketability of the end produce. Sulphur plays significant role in imparting disease resistance of the crop and it increases the keeping quality or shelf life of the end produce. Moreover, Potassium Schoenite is known to correct the disturbed cationic ratio of Ca:Mg:K due to excessive amounts of Potassic fertilizers applied to get increased yields of the crop. Thus it improves the Cation Exchange Capacity of the soil which ultimately governs the supplementation of nutrients to the crop through soil.",
	"Recommendation":{
		"Through Soil":"For Horticultural crops - 25 kg / acre, For other crops - 10 - 12 kg / acre",
		"Through Foliar":"Dissolve 1 kg Potassium Schoenite in 100 lit water and to be sprayed uniformly for 2 times each in vegetative and pre- maturity stage of the crop at 15 days interval.",
		"Through Drip":"Since Potassium Schoenite is 100% Water Soluble, it can be solely applied or mixed with NPK fertilizers. Apply 3-4 kg/acre for 4-5 times at weekly intervals in pre-maturity stage of the crop."
	}
},
{
	"Product":"Calcium Nitrate",
	"Sub-Desc":"",
	"Description":"It contains 15.5 % Nitrogen and 18.5% Calcium. Besides Calcium it supplies Nitrogen in its readily available Nitrate form. It increases the acidity in soil, thus; helps to reduce soil pH up to some extent. Light and sandy soils with alkaline pH prevailing in Kinnow growing areas pose problems for availability of Calcium, which is a limiting factor in Kinnow cultivation. Therefore, the use of Calcium Nitrate is recommended.",
	"Recommendation":""
}]