[
{
	"Product":"BORACOL BSF-11",
	"Sub_Desc":"",
	"Description":"It is a micronutrient mixture fertilizer to be applied through soil especially for long duration crops like Fruit Crops. It contains all essential micronutrients viz. Iron, Manganese, Zinc, Copper and Boron in requisite amounts. Hence, farmer seldom has to apply any single micronutrient to his crop. Except Single Super Phosphate, it can be very well mixed with other fertilizers applied through the soil. The reason is Sulphate salts of Iron, Manganese, Zinc and Copper in Boracol are readily water soluble, hence these nutrients become available for uptake very quickly. However, mixing Boracol with SSP tends to formation of Phosphates of these nutrients, which are not soluble in water, they get fixed in the soil and finally become available after considerably long time.",
	"Recommendation":""
},
{
	"Product":"BORACOL BSF-12",
	"Sub_Desc":"MICRONUTRIENT SOIL APPLICATION FOR PLANTATION CROPS",
	"Description":"We know that in the programme of crop production, yield is the function of nutrition. Here nutrition of the crop comprises all the 12 essential nutrients of three groups namely, major, secondary and micronutrients. The sole source of nutrients to any crop is soil, however, when the demands of the cultivated crops are much high than the soil could support, we go for external supplementation of nutrients through fertilizers which not only get restricted for NPK fertilizers but also include secondary and micronutrients. Boracol BSF – 12 is boron based multi micronutrient mixture meant for soil application, formulated for quick release of micronutrients in a balanced form in ionic form once it gets mixed with soil at the root zone of the crops. It contains all the six essential micronutrients i.e Iron, Manganese, Zinc, Copper, Boron and Molybdenum. All the contents are in inorganic form. The major factors like purity of the elements, elemental ratios, nutrient interaction, release of elements etc are given importance in the technology of making Boracol BSF 12 as product. Soil nutrient status, crop requirements are considered while formulating this product.",
	"Recommendation":"This product is recommended for all irrigated short duration crops and plantation crops like Coffee, Cardamom and Pepper. Boracol BSF 12 can be mixed with other NPK fertilizers and applied to the root zone. Boracol starts releasing the nutrients one week after its application and remain active in supplementing the nutrients up to 75 days. Boracol BSF 12 can be used @ 10 Kg per acre as pre-monsoon and 10 Kg per acre as post-monsoon dose for crops like coffee and cardamom to get normal and minimum yields. For pepper it is suggested to use 50 gm per vine as a pre monsoon and 50 gm per vine as a post-monsoon for matured yielding vines. However the dosages differ from soil to soil and yield levels of different crops for which we suggest you to contact our office for site specific recommendations and to get targeted yields."	
}]