[
{
	"Product":"EPSRITE",
	"Sub-Desc":"SOIL CONDITIONER FOR ACIDIC SOILS",
	"Description":"EpsRite is a Soil Conditioner recommended for acidic soils. It contains secondary elements like calcium, magnesium and Sulphur. This can be mixed with other regular NPK fertilizers and applied in the root zone. NPK fertilizers are better utilized in presence of EpsRite in acidic soils. At varied pH of soils, the exchangeable sites for nutrients in ionic forms become blocked by excess of presence of aluminium and hydroxyl ions which affects the availability of nutrients from the soil to the plants. For better utilization of applied fertilizer doses, it is necessary to remove these ions by increasing the pH of the soil. EpsRite is a rich mineral soil conditioner for acidic soils which contains Calcium, Magnesium and Sulphur in 3% : 2% :1% proportion and is recommended for use in rhizosphere of the crops along with any other chemical fertilizers. The chemicals present in EpsRite along with helping in raising the pH of the soil so that the absorption capacity of the nutrients by the plants increases and also helps in supplementing secondary essential nutrients.",
	"Recommendation":"Use of EpsRite is restricted to rhizosphere only and not recommended for bulk soil. For plantation crops like coffee, cardamom, pepper, arecanut, it is recommended @ 50 kg per acre as a pre monsoon and 50 kg per acre as post monsoon dose along with NPK and micronutrient fertilizers."
},
{
	"Product":"Chrocal",
	"Sub-Desc":"",
	"Description":"It is a mineral soil conditioner for Saline-Sodic Soils. We recommend its application when both; soil pH and Sodium Content are high and hinder the availability and uptake of nutrients. Besides Calcium (2%) and Magnesium (8%), it also contains Silica (8%). Silica being the strongest cation neutralizes the effect of Sodium, thus increasing the availability of other essential cations viz. Potassium, Calcium, Magnesium, Iron, Manganese, Zinc and Copper. We recommend applying 25 kg Chrocal per acre in bulk soil (whole plot) at the time of final land preparation.",
	"Recommendation":""
}]